### prod-ci-roles Part # 1
  #### Terragrunt Format and Style 🖌`success`
  #### Terragrunt Initialization ⚙️`success`
  #### Terragrunt Validation 🤖`success`

  <details><summary>Validation Output</summary>

  ```
  Success! The configuration is valid.


  ```

  </details>

  #### Terragrunt Plan 📖`success`
  <details><summary>Show Plan</summary>

  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.name will be created
  + resource "aws_iam_policy" "name" {
      + arn         = (known after apply)
      + description = "IAM policy for CI runners with restricted permissions to create and manage AWS resources."
      + id          = (known after apply)
      + name        = "ci-permission-boundary"
      + name_prefix = (known after apply)
      + path        = "/ci"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter*",
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "ec2:UnassignPrivateIpAddresses",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:AssignPrivateIpAddresses",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CIRunnerPermissionsBoundary"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.ci_role["github-ci-admin"] will be destroyed
  # (because key ["github-ci-admin"] is not in for_each map)
  - resource "aws_iam_role" "ci_role" {
      - arn                   = "arn:aws:iam::310394544294:role/github-ci-admin" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "token.actions.githubusercontent.com:sub" = [
                                  - "repo:kolvin/kloud:pull_request",
                                  - "repo:kolvin/kloud:ref:refs/heads/*",
                                  - "repo:kolvin/kloud:ref:refs/tags/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::310394544294:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = "TrustPolicy"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-06-11T19:13:26Z" -> null
      - force_detach_policies = false -> null
      - id                    = "github-ci-admin" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "github-ci-admin" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAUQRHU4CTG6DGTJOMN" -> null
    }

  # aws_iam_role.ci_role["github-ci-infrastructure-provisoner"] will be created
  + resource "aws_iam_role" "ci_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:kolvin/kloud:pull_request",
                                  + "repo:kolvin/kloud:ref:refs/heads/*",
                                  + "repo:kolvin/kloud:ref:refs/tags/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::310394544294:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = "TrustPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-ci-infrastructure-provisoner"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.ci_inline_policy["github-ci-infrastructure-provisoner"] will be created
  + resource "aws_iam_role_policy" "ci_inline_policy" {
      + id     = (known after apply)
      + name   = "base"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:*",
                          + "s3:*",
                          + "logs:*",
                          + "lambda:*",
                          + "ecs:*",
                          + "ec2:*",
                          + "cloudwatch:*",
                          + "cloudformation:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ssm:GetParameter*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:*::parameter/aws/service/*"
                    },
                  + {
                      + Action    = [
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:CreateRole",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "iam:PermissionsBoundary" = "arn:aws:iam::310394544294:policy/ci-permission-boundary"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::310394544294:role/application-roles/*"
                    },
                  + {
                      + Action    = [
                          + "iam:DetachRolePolicy",
                          + "iam:AttachRolePolicy",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "iam:PermissionsBoundary" = "arn:aws:iam::310394544294:policy/ci-permission-boundary"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::310394544294:role/application-roles/*"
                    },
                  + {
                      + Action   = [
                          + "iam:UntagRole",
                          + "iam:TagRole",
                          + "iam:GetRolePolicy",
                          + "iam:GetRole",
                          + "iam:DeleteRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::310394544294:role/application-roles/*"
                    },
                  + {
                      + Action   = [
                          + "iam:UntagPolicy",
                          + "iam:TagPolicy",
                          + "iam:SetDefaultPolicyVersion",
                          + "iam:ListPolicyVersions",
                          + "iam:GetPolicy",
                          + "iam:DeletePolicyVersion",
                          + "iam:DeletePolicy",
                          + "iam:CreatePolicyVersion",
                          + "iam:CreatePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::310394544294:policy/application-role-policies/*"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::310394544294:role/application-roles/*"
                    },
                  + {
                      + Action   = "iam:ListRoles"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "iam:GetRole"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::310394544294:role/aws-service-role/*",
                          + "arn:aws:iam::310394544294:role/application-roles/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.ci_managed_policy["github-ci-admin_AdministratorAccess"] will be destroyed
  # (because key ["github-ci-admin_AdministratorAccess"] is not in for_each map)
  - resource "aws_iam_role_policy_attachment" "ci_managed_policy" {
      - id         = "github-ci-admin-20230611191326769600000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - role       = "github-ci-admin" -> null
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ role_arns            = [
      - "arn:aws:iam::310394544294:role/github-ci-admin",
      + (known after apply),
    ]
  ~ role_inline_polices  = {
      + github-ci-infrastructure-provisoner = [
          + {
              + actions    = [
                  + "sqs:*",
                  + "s3:*",
                  + "cloudwatch:*",
                  + "cloudformation:*",
                  + "logs:*",
                  + "lambda:*",
                  + "ec2:*",
                  + "ecs:*",
                ]
              + conditions = []
              + effect     = "Allow"
              + resources  = [
                  + "*",
                ]
              + sid        = null
            },
          + {
              + actions    = [
                  + "ssm:GetParameter*",
                ]
              + conditions = []
              + effect     = "Allow"
              + resources  = [
                  + "arn:aws:ssm:*::parameter/aws/service/*",
                ]
              + sid        = null
            },
          + {
              + actions    = [
                  + "iam:CreateRole",
                  + "iam:PutRolePolicy",
                  + "iam:DeleteRolePolicy",
                ]
              + conditions = [
                  + {
                      + test     = "ArnEquals"
                      + values   = [
                          + "arn:aws:iam::310394544294:policy/ci-permission-boundary",
                        ]
                      + variable = "iam:PermissionsBoundary"
                    },
                ]
              + effect     = "Allow"
              + resources  = [
                  + "arn:aws:iam::310394544294:role/application-roles/*",
                ]
              + sid        = null
            },
          + {
              + actions    = [
                  + "iam:AttachRolePolicy",
                  + "iam:DetachRolePolicy",
                ]
              + conditions = [
                  + {
                      + test     = "ArnEquals"
                      + values   = [
                          + "arn:aws:iam::310394544294:policy/ci-permission-boundary",
                        ]
                      + variable = "iam:PermissionsBoundary"
                    },
                ]
              + effect     = "Allow"
              + resources  = [
                  + "arn:aws:iam::310394544294:role/application-roles/*",
                ]
              + sid        = null
            },
          + {
              + actions    = [
                  + "iam:DeleteRole",
                  + "iam:TagRole",
                  + "iam:UntagRole",
                  + "iam:GetRole",
                  + "iam:GetRolePolicy",
                ]
              + conditions = []
              + effect     = "Allow"
              + resources  = [
                  + "arn:aws:iam::310394544294:role/application-roles/*",
                ]
              + sid        = null
            },
          + {
              + actions    = [
                  + "iam:CreatePolicy",
                  + "iam:DeletePolicy",
                  + "iam:CreatePolicyVersion",
                  + "iam:DeletePolicyVersion",
                  + "iam:GetPolicy",
                  + "iam:TagPolicy",
                  + "iam:UntagPolicy",
                  + "iam:SetDefaultPolicyVersion",
                  + "iam:ListPolicyVersions",
                ]
              + conditions = []
              + effect     = "Allow"
              + resources  = [
                  + "arn:aws:iam::310394544294:policy/application-role-policies/*",
                ]
              + sid        = null
            },
          + {
              + actions    = [
                  + "iam:PassRole",
                ]
              + conditions = []
              + effect     = "Allow"
              + resources  = [
                  + "arn:aws:iam::310394544294:role/application-roles/*",
                ]
              + sid        = null
            },
          + {
              + actions    = [
                  + "iam:ListRoles",
                ]
              + conditions = []
              + effect     = "Allow"
              + resources  = [
                  + "*",
                ]
              + sid        = null
            },
          + {
              + actions    = [
                  + "iam:GetRole",
                ]
              + conditions = []
              + effect     = "Allow"
              + resources  = [
                  + "arn:aws:iam::310394544294:role/application-roles/*",
                  + "arn:aws:iam::310394544294:role/aws-service-role/*",
                ]
              + sid        = null
            },
        ]
    }
  ~ role_managed_polices = {
      - github-ci-admin = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ]
    }
  ~ role_names           = [
      - "github-ci-admin",
      + "github-ci-infrastructure-provisoner",
    ]

  ```

  </details>

  *Pusher: @kolvin, Action: `pull_request`, Working Directory: `environments/prod/global/`, Workflow: `prod-ci-roles`*